tests/performance/results/final-reports/local-20260423/hot-slot-race.log
Prometheus remote write: http://localhost:9090/api/v1/write
k6 testid: 20260423-final-report-hot-slot-race
Trend stats: p(90),p(95),avg,min,max

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: tests/performance/k6/hot-slot-race.js
        output: Prometheus remote write (http://localhost:9090/api/v1/write)

     scenarios: (100.00%) 1 scenario, 60 max VUs, 1m0s max duration (incl. graceful stop):
              * hot_slot_race: 15.00 iterations/s for 30s (maxVUs: 30-60, gracefulStop: 30s)


running (0m01.0s), 15/30 VUs, 0 complete and 0 interrupted iterations
hot_slot_race   [   3% ] 15/30 VUs  01.0s/30s  15.00 iters/s

running (0m02.0s), 15/30 VUs, 15 complete and 0 interrupted iterations
hot_slot_race   [   7% ] 15/30 VUs  02.0s/30s  15.00 iters/s

running (0m03.0s), 15/30 VUs, 30 complete and 0 interrupted iterations
hot_slot_race   [  10% ] 15/30 VUs  03.0s/30s  15.00 iters/s

running (0m04.0s), 15/30 VUs, 45 complete and 0 interrupted iterations
hot_slot_race   [  13% ] 15/30 VUs  04.0s/30s  15.00 iters/s

running (0m05.0s), 15/30 VUs, 60 complete and 0 interrupted iterations
hot_slot_race   [  17% ] 15/30 VUs  05.0s/30s  15.00 iters/s

running (0m06.0s), 15/30 VUs, 75 complete and 0 interrupted iterations
hot_slot_race   [  20% ] 15/30 VUs  06.0s/30s  15.00 iters/s

running (0m07.0s), 15/30 VUs, 90 complete and 0 interrupted iterations
hot_slot_race   [  23% ] 15/30 VUs  07.0s/30s  15.00 iters/s

running (0m08.0s), 15/30 VUs, 105 complete and 0 interrupted iterations
hot_slot_race   [  27% ] 15/30 VUs  08.0s/30s  15.00 iters/s

running (0m09.0s), 15/30 VUs, 120 complete and 0 interrupted iterations
hot_slot_race   [  30% ] 15/30 VUs  09.0s/30s  15.00 iters/s

running (0m10.0s), 15/30 VUs, 135 complete and 0 interrupted iterations
hot_slot_race   [  33% ] 15/30 VUs  10.0s/30s  15.00 iters/s

running (0m12.8s), 15/30 VUs, 150 complete and 0 interrupted iterations
hot_slot_race   [  37% ] 15/30 VUs  11.0s/30s  15.00 iters/s

running (0m13.8s), 15/30 VUs, 165 complete and 0 interrupted iterations
hot_slot_race   [  40% ] 15/30 VUs  12.0s/30s  15.00 iters/s

running (0m14.8s), 15/30 VUs, 180 complete and 0 interrupted iterations
hot_slot_race   [  43% ] 15/30 VUs  13.0s/30s  15.00 iters/s

running (0m15.8s), 15/30 VUs, 195 complete and 0 interrupted iterations
hot_slot_race   [  47% ] 15/30 VUs  14.0s/30s  15.00 iters/s

running (0m16.8s), 15/30 VUs, 210 complete and 0 interrupted iterations
hot_slot_race   [  50% ] 15/30 VUs  15.0s/30s  15.00 iters/s

running (0m17.8s), 15/30 VUs, 225 complete and 0 interrupted iterations
hot_slot_race   [  53% ] 15/30 VUs  16.0s/30s  15.00 iters/s

running (0m18.8s), 15/30 VUs, 240 complete and 0 interrupted iterations
hot_slot_race   [  57% ] 15/30 VUs  17.0s/30s  15.00 iters/s

running (0m19.8s), 15/30 VUs, 255 complete and 0 interrupted iterations
hot_slot_race   [  60% ] 15/30 VUs  18.0s/30s  15.00 iters/s

running (0m20.8s), 15/30 VUs, 270 complete and 0 interrupted iterations
hot_slot_race   [  63% ] 15/30 VUs  19.0s/30s  15.00 iters/s

running (0m21.8s), 15/30 VUs, 285 complete and 0 interrupted iterations
hot_slot_race   [  67% ] 15/30 VUs  20.0s/30s  15.00 iters/s

running (0m22.8s), 15/30 VUs, 300 complete and 0 interrupted iterations
hot_slot_race   [  70% ] 15/30 VUs  21.0s/30s  15.00 iters/s

running (0m23.8s), 15/30 VUs, 315 complete and 0 interrupted iterations
hot_slot_race   [  73% ] 15/30 VUs  22.0s/30s  15.00 iters/s

running (0m24.8s), 15/30 VUs, 330 complete and 0 interrupted iterations
hot_slot_race   [  77% ] 15/30 VUs  23.0s/30s  15.00 iters/s

running (0m25.8s), 15/30 VUs, 345 complete and 0 interrupted iterations
hot_slot_race   [  80% ] 15/30 VUs  24.0s/30s  15.00 iters/s

running (0m26.8s), 15/30 VUs, 360 complete and 0 interrupted iterations
hot_slot_race   [  83% ] 15/30 VUs  25.0s/30s  15.00 iters/s

running (0m27.8s), 15/30 VUs, 375 complete and 0 interrupted iterations
hot_slot_race   [  87% ] 15/30 VUs  26.0s/30s  15.00 iters/s

running (0m28.8s), 15/30 VUs, 390 complete and 0 interrupted iterations
hot_slot_race   [  90% ] 15/30 VUs  27.0s/30s  15.00 iters/s

running (0m29.8s), 15/30 VUs, 405 complete and 0 interrupted iterations
hot_slot_race   [  93% ] 15/30 VUs  28.0s/30s  15.00 iters/s

running (0m30.8s), 15/30 VUs, 420 complete and 0 interrupted iterations
hot_slot_race   [  97% ] 15/30 VUs  29.0s/30s  15.00 iters/s

running (0m31.8s), 15/30 VUs, 435 complete and 0 interrupted iterations
hot_slot_race   [ 100% ] 15/30 VUs  30.0s/30s  15.00 iters/s

running (0m32.8s), 01/30 VUs, 450 complete and 0 interrupted iterations
hot_slot_race ↓ [ 100% ] 16/30 VUs  30s  15.00 iters/s


  █ THRESHOLDS 

    checks
    ✓ 'rate==1' rate=100.00%

    hot_slot_status_5xx
    ✓ 'count==0' count=0

    http_req_duration
    ✓ 'p(95)<2000' p(95)=5.56ms


  █ TOTAL RESULTS 

    checks_total.......: 1815    55.216289/s
    checks_succeeded...: 100.00% 1815 out of 1815
    checks_failed......: 0.00%   0 out of 1815

    ✓ list slots status is 200
    ✓ hot slot setup product status is 201
    ✓ target hot slot is visible
    ✓ reservation status is 201 or 409
    ✓ reservation never 5xx
    ✓ list products status is 200
    ✓ list reservations status is 200
    ✓ hot slot reservations never exceed initial remaining capacity
    ✓ hot slot reserved quantity never exceeds product stock
    ✓ hot slot remaining capacity never negative
    ✓ hot slot remaining capacity matches reservation count
    ✓ hot slot product stock never negative
    ✓ hot slot product stock matches reserved quantity

    CUSTOM
    hot_slot_status_201............: 6      0.182533/s
    hot_slot_status_409............: 445    13.537878/s
    hot_slot_status_5xx............: 0      0/s

    HTTP
    http_req_duration..............: avg=3.24ms min=1.43ms med=2.93ms max=14.02ms p(90)=4.73ms p(95)=5.56ms
      { expected_response:true }...: avg=2.51ms min=1.43ms med=2.25ms max=14.02ms p(90)=3.3ms  p(95)=3.96ms
    http_req_failed................: 49.06% 445 out of 907
    http_reqs......................: 907    27.592933/s

    EXECUTION
    iteration_duration.............: avg=1s     min=1s     med=1s     max=1.01s   p(90)=1.01s  p(95)=1.01s 
    iterations.....................: 451    13.720411/s
    vus............................: 1      min=1          max=15
    vus_max........................: 30     min=30         max=30

    NETWORK
    data_received..................: 718 kB 22 kB/s
    data_sent......................: 199 kB 6.0 kB/s



running (0m32.9s), 00/30 VUs, 451 complete and 0 interrupted iterations
hot_slot_race ✓ [ 100% ] 00/30 VUs  30s  15.00 iters/s